x1 <-c(-1,...        1)
x2 <-c(-1,...        1)
x3 <-c(1,...        1)
x4 <-c(-1,...        -1)
x5 <-c(-1,...        -1)
x6 <-c(1,...        1)
y<-c(19.0832376437,...17.4004932366)
x12<-x1*x2# в залежності від кількості хскласти всі можливі комбінації x13<-x1*x3
x14<-x1*x4
x15<-x1*x5
x16<-x1*x6
x23<-x2*x3
x24<-x2*x4
x25<-x2*x5
x26<-x2*x6
x34<-x3*x4 
x35<-x3*x5
x36<-x3-x6
x45<-x4*x5
x46<-x4*x6
x56<-x5*x6
x<-rbind(x1, x2, x3, x4, x5, x6, x12,x13,x14,x15,x16,                  x23,         x24,         x25,x26,                  x34,         x35,x36,                  x45,         x46,         x56                  ) 
N=length(y)
a0<-sum(y)/N
a<-c(0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0) #    кіль-кість нулів відповідаєкількості комбінацій з х
M=length(a)
for(j in 1:N)
  for(i in 1:M)
    a[i]<-a[i]+(y[j]*x[i, j])
for(i in 1:M)
  a[i]<-a[i]/N
s<-c("x1",   "x2",   "x3",   "x4",   "x5",   "x6",      "x1*x2",      "x1*x3",     "x1*x4",          "x1*x5",          "x1*x6",    "x2*x3",          "x2*x4",          "x2*x5", "x2*x6",          "x3*x4",          "x3*x5",  "x3*x6",          "x4*x5",          "x4*x6",  "x5*x6") 
s1=""
for(i in 1:M)
  s1<-paste0(s1, sprintf("% + f*%s", a[i], s[i]))
s2<-paste0("y = ", a0, s1)
s2