import matplotlib.pyplot as plt

# Ваші дані з таблиці 4.2
N_list = [
    20000,
    40000,
    60000,
    80000,
    100000,
    120000,
    140000,
    160000,
    180000,
    200000,
    220000,
    240000,
]

# Розрахунок прискорення S
S_N = [
    68.195122,
    33.636090,
    22.604317,
    16.830699,
    13.714285,
    11.274193,
    9.8038809,
    8.4453902,
    7.4375188,
    6.8340971,
    6.2311140,
    5.5590248,
]

plt.figure(figsize=(10, 5))
plt.plot(N_list, S_N, "gs-", label="Прискорення S(N) на P=4")
plt.xlabel("Кількість членів ряду (N)")
plt.ylabel("Прискорення (S)")
plt.title("Залежність прискорення від розміру задачі (N)")
plt.grid(True)
plt.legend()
plt.show()
