import matplotlib.pyplot as plt

# Ваші дані з таблиці 4.2
N_list = [
    20000,
    40000,
    60000,
    80000,
    100000,
    120000,
    140000,
    160000,
    180000,
    200000,
    220000,
    240000,
]

# Розрахунок прискорення S
S_N = [
    3.6352549,
    3.5671907,
    3.5930179,
    3.5668650,
    3.6222061,
    3.5801411,
    3.6238594,
    3.5661769,
    3.5306208,
    3.6060606,
    3.6274216,
    3.5320937,
]

plt.figure(figsize=(10, 5))
plt.plot(N_list, S_N, "gs-", label="Прискорення S(N) на P=4")
plt.xlabel("Кількість членів ряду (N)")
plt.ylabel("Прискорення (S)")
plt.title("Залежність прискорення від розміру задачі (N)")
plt.grid(True)
plt.legend()
plt.show()
